; domain
(define (domain rover-mining)
(:requirements :strips :negative-preconditions)
(:predicates
    ; static — the path network never changes during planning
    (CONNECTED ?from ?to)
    ; static — marks which locations are analysis laboratories
    (LAB ?loc)

    ; fluents
    (at ?rover ?loc)
    (mineral-at ?mineral ?loc)
    (free ?rover)
    (carrying ?rover ?mineral)
    (analyzed ?mineral)
)

(:action move
    :parameters (?rover ?from ?to)
    :precondition
    (and
        (at ?rover ?from)
        (CONNECTED ?from ?to)
    )
    :effect
    (and
        (not (at ?rover ?from))
        (at ?rover ?to)
    )
)

(:action pick-up
    :parameters (?rover ?mineral ?loc)
    :precondition
    (and
        (at ?rover ?loc)
        (mineral-at ?mineral ?loc)
        (free ?rover)
    )
    :effect
    (and
        (carrying ?rover ?mineral)
        (not (mineral-at ?mineral ?loc))
        (not (free ?rover))
    )
)

(:action deliver
    :parameters (?rover ?mineral ?loc)
    :precondition
    (and
        (at ?rover ?loc)
        (carrying ?rover ?mineral)
        (LAB ?loc)
    )
    :effect
    (and
        (analyzed ?mineral)
        (not (carrying ?rover ?mineral))
        (free ?rover)
    )
)

)

; problem
; Problema base tal como lo describe la actividad:
; un rover en l4 debe recoger dos minerales ya excavados en l1 y l2,
; y llevarlos al laboratorio en l5, respetando las restricciones de
; trayectoria del esquema (Figura 1 de la actividad).
(define (problem rover-mining-p1)
(:domain rover-mining)
(:objects
    l1 l2 l3 l4 l5 - object
    rover1 - object
    mineral1 mineral2 - object
)
(:init
    ; red de trayectorias (dirigida, ver Figura 1)
    (CONNECTED l1 l3) (CONNECTED l3 l1)   ; l1-l3 bidireccional
    (CONNECTED l3 l2)                     ; l3->l2 solo una direccion
    (CONNECTED l2 l4)                     ; l2->l4 solo una direccion
    (CONNECTED l3 l4) (CONNECTED l4 l3)   ; l3-l4 bidireccional
    (CONNECTED l4 l5) (CONNECTED l5 l4)   ; l4-l5 bidireccional

    (LAB l5)

    (at rover1 l4)
    (free rover1)

    (mineral-at mineral1 l1)
    (mineral-at mineral2 l2)
)
(:goal
    (and
        (analyzed mineral1)
        (analyzed mineral2)
    )
)
)

; plan
1. (move rover1 l4 l3)
   deleted: (at rover1 l4)
   added: (at rover1 l3)
   goals met: 0 of 2
2. (move rover1 l3 l2)
   deleted: (at rover1 l3)
   added: (at rover1 l2)
   goals met: 0 of 2
3. (pick-up rover1 mineral2 l2)
   deleted: (mineral-at mineral2 l2) (free rover1)
   added: (carrying rover1 mineral2)
   goals met: 0 of 2
4. (move rover1 l2 l4)
   deleted: (at rover1 l2)
   added: (at rover1 l4)
   goals met: 0 of 2
5. (move rover1 l4 l5)
   deleted: (at rover1 l4)
   added: (at rover1 l5)
   goals met: 0 of 2
6. (deliver rover1 mineral2 l5)
   deleted: (carrying rover1 mineral2)
   added: (analyzed mineral2) (free rover1)
   goals met: 1 of 2
7. (move rover1 l5 l4)
   deleted: (at rover1 l5)
   added: (at rover1 l4)
   goals met: 1 of 2
8. (move rover1 l4 l3)
   deleted: (at rover1 l4)
   added: (at rover1 l3)
   goals met: 1 of 2
9. (move rover1 l3 l1)
   deleted: (at rover1 l3)
   added: (at rover1 l1)
   goals met: 1 of 2
10. (pick-up rover1 mineral1 l1)
   deleted: (mineral-at mineral1 l1) (free rover1)
   added: (carrying rover1 mineral1)
   goals met: 1 of 2
11. (move rover1 l1 l3)
   deleted: (at rover1 l1)
   added: (at rover1 l3)
   goals met: 1 of 2
12. (move rover1 l3 l4)
   deleted: (at rover1 l3)
   added: (at rover1 l4)
   goals met: 1 of 2
13. (move rover1 l4 l5)
   deleted: (at rover1 l4)
   added: (at rover1 l5)
   goals met: 1 of 2
14. (deliver rover1 mineral1 l5)
   deleted: (carrying rover1 mineral1)
   added: (analyzed mineral1) (free rover1)
   goals met: 2 of 2
